In [7]:
import pymysql
from sqlalchemy import create_engine,text
import pandas as pd
import numpy as np
import getpass

In [8]:
password = getpass.getpass()

········

In [9]:
connection_string='mysql+pymysql://root:'+password+'@localhost/sakila'
engine=create_engine(connection_string)

In [10]:
engine.execute('DROP TABLE IF EXISTS rentals_may')
engine.execute('DROP TABLE IF EXISTS rentals_june')

# Instructions
In this lab we will find the customers who were active in consecutive months of May and June. Follow the steps to complete the analysis.

- Create a table rentals_may to store the data from rental table with information for the month of May.
- Insert values in the table rentals_may using the table rental, filtering values only for the month of May.

In [11]:
engine.execute('CREATE TABLE IF NOT EXISTS rentals_may( \
              `rental_id` int UNIQUE NOT NULL,  \
              `rental_date` datetime DEFAULT NULL, \
              `inventory_id` int DEFAULT NULL,  \
              `customer_id` int DEFAULT NULL,  \
              `return_date` datetime DEFAULT NULL, \
              `staff_id` int DEFAULT NULL,  \
              `last_update` datetime DEFAULT NULL,  \
              CONSTRAINT PRIMARY KEY (rental_id) \
              )')

In [12]:
engine.execute('INSERT INTO rentals_may(rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update) \
                SELECT rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update \
                FROM rental \
                WHERE MONTH(rental_date) = 5 \
                ')

- Create a table rentals_june to store the data from rental table with information for the month of June.
- Insert values in the table rentals_june using the table rental, filtering values only for the month of June.

In [13]:
engine.execute('CREATE TABLE IF NOT EXISTS rentals_june( \
              `rental_id` int UNIQUE NOT NULL,  \
              `rental_date` datetime DEFAULT NULL, \
              `inventory_id` int DEFAULT NULL,  \
              `customer_id` int DEFAULT NULL,  \
              `return_date` datetime DEFAULT NULL, \
              `staff_id` int DEFAULT NULL,  \
              `last_update` datetime DEFAULT NULL,  \
              CONSTRAINT PRIMARY KEY (rental_id) \
              )')

In [14]:
engine.execute('INSERT INTO rentals_june(rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update) \
                SELECT rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update \
                FROM rental \
                WHERE MONTH(rental_date) = 6 \
                ')

- Check the number of rentals for each customer for May.

In [15]:
number_rentals_may = engine.execute('SELECT count(rental_id) FROM rentals_may')
number_rentals_may

- Check the number of rentals for each customer for June.

In [16]:
number_rentals_june = engine.execute('SELECT count(rental_id) FROM rentals_june')
number_rentals_june

Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

In [17]:
table_may = pd.read_sql_query(' SELECT * FROM rentals_may',engine)
table_may

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [18]:
table_june = pd.read_sql_query(' SELECT * FROM  rentals_june',engine)
table_june

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

- Check the number of rentals for each customer for May

In [19]:
len(table_may)

1156

- Check the number of rentals for each customer for June

In [20]:
len(table_june)

2311

- Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the merge function.
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html

In [30]:
table = table_may.merge(table_june, how='outer')
table

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
3462,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
3463,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
3464,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
3465,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
3466,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

In [41]:
def compared_rental(df, customer_id):
    # Convertimos la columa en formato fecha
    df['rental_date'] = pd.to_datetime(df['rental_date']) 
    # Seleccionar las filas correspondientes al cliente y a los meses de mayo y junio
    prestamos_mayo = df[(df["customer_id"] == customer_id) & (df["rental_date"].dt.month == 5)]
    prestamos_junio = df[(df["customer_id"] == customer_id) & (df["rental_date"].dt.month == 6)]
    
    # Contar el número de préstamos en mayo y junio
    num_prestamos_mayo = len(prestamos_mayo)
    num_prestamos_junio = len(prestamos_junio)
    
    # Comparar el número de préstamos y mostrar el resultado
    if num_prestamos_mayo < num_prestamos_junio:
        print("The customer borrowed more movies in June than in May.")
    elif num_prestamos_mayo > num_prestamos_junio:
        print("The customer borrowed fewer movies in June than in May.")
    else:
        print("The customer borrowed the same number of movies in May and in June.")

In [42]:
compared_rental(table,181)

The customer borrowed more movies in June than in May.